my-app/server/__tests__/artillery/reviews.yml
config:
  target: "http://ec2-3-144-88-19.us-east-2.compute.amazonaws.com"
  phases:
    - duration: 10
      arrivalRate: 1000
      rampTo: 50000
      name: Warm up phase
    # - duration: 20
    #   arrivalRate: 5000
    #   rampTo: 7500
    #   name: Ramp up load
    # - duration: 10
    #   arrivalRate: 7500
    #   rampTo: 10000
    #   name: Spike phase

scenarios:
  - name: /reviews
    flow:
      - get:
          url: "/reviews"
  # - name: /reviews/:id
  #   flow:
  #     - get:
  #         url: "/reviews/{{ $randomNumber(1, 1000000) }}"
  # - name: /reviews/meta
  #   flow:
  #     - get:
  #         url: "/reviews/meta"